import os,random,csv
from shutil import copyfile,copy,copy2
from pathlib import Path
Number_of_people = input("How many numbes of people you want to create?")
Location = input("what location you want to store the data?")
for i in range(0,int(Number_of_people)):
    first_name = ["趙","錢","孫","李","週","吳","鄭","王","馮","陳","褚","衛","蔣","沈","韓","楊","朱","秦","尤","許","何","呂","施","張","孔","曹","嚴","華","金","魏","陶","姜","戚","謝","鄒","喻","柏","水","竇","章","雲","蘇","潘","葛","奚","範","彭","郎","魯","韋","昌","馬"]
    second_name = ["家","珈","貝","楠","希","辛","潁","英","敬","莫","群","海","渲","兒","與","釣","怡","艾","雪","安","愛","書","牛","新","婷","鐺","妙","晴","葶","歡","羊","娜","瀟","奧","末","城","圖","星","天","敏","銘","婷","君","豪","偉","然","軒","萱","涵","翔","廷","恩","翔","辰","睿","恩","宇","妍","晴","彤","妤","語","綺","獸","俠","飛","軒","丁","寧","艾","點","彬","傑","美","叮","熊","翔","苗","東","奇","寶","可","智","兒","然","逸","健","筆","七","裕","侃","可","福","嵐","夕","博","榮","哲","佛","阿","皓","輝","楊","淼","琦","朗","昂","月","嚕","賽","紅","餃","岸","偉","拉","斐","保","銘","艾","濛","雅","怡","家","志","浩","子","皓","梓","詩","宥","承","宇","品","睿","宸","柏","語","品","詠","羽","子","禹","品","芯","恩","思"]
    third_name = ["貝","楠","希","辛","潁","英","敬","莫","群","海","渲","兒","與","釣","怡","艾","雪","安","愛","書","牛","新","婷","鐺","妙","晴","葶","歡","羊","娜","瀟","奧","末","城","圖","星","天","敏","銘","婷","君","豪","偉","然","軒","萱","涵","翔","廷","恩","翔","辰","睿","恩","宇","妍","晴","彤","妤","語","綺","獸","俠","飛","軒","丁","寧","艾","點","彬","傑","美","叮","熊","翔","苗","東","奇","寶","可","智","兒","然","逸","健","筆","七","裕","侃","可","福","嵐","夕","博","榮","哲","佛","阿","皓","輝","楊","淼","琦","朗","昂","月","嚕","賽","紅","餃","岸","偉","拉","斐","保","銘","艾","濛","雅","怡","家","志","浩","子","皓","梓","詩","宥","承","宇","品","睿","宸","柏","語","品","詠","羽","子","禹","品","芯","恩","思"]
    name = random.choice(first_name) + random.choice(second_name) + random.choice(third_name)
    #print(Location + '\\train\\images\\' + name)
    os.makedirs(Location + '\\train\\images\\' + name,exist_ok = True)
    copy('C://Users//Huang//Documents//health_data//1.png',Location + '\\train\\images\\' + name)